src/InformationRegisters/кфкВходящиеСообщения/кфкВходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f414732c-dcdc-4e52-825c-4b00cf4fa6e2">
  <name>кфкВходящиеСообщения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="40e13da9-a528-4570-883e-2c907efb0364">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b7a46c86-21a3-43b1-9f53-d74a8fdccb2f">
    <name>Заголовки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="40670889-dab8-4e97-83f0-746662cb9168">
    <name>ТелоСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="bd26b858-29df-4c6e-ba4a-75d5f9a60683">
    <name>Консьюмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01079ff5-5033-46d9-af80-34e06690eabd">
    <name>Топик</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="674a635a-7c60-483a-aa26-18543e47cd4e">
    <name>Раздел</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f6fdbc5d-cd8b-4e9f-aef2-14902fcd3d2b">
    <name>Смещение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>32</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9504695b-0eb6-4677-b1ca-4823a52689aa">
    <name>КлючСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="09c9dd9a-de2f-4730-a615-93cb72742570">
    <name>ДатаЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bfe7b38d-d429-4caa-b272-7de24cf9ca09">
    <name>ДатаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf1cd89a-5799-49dd-be8b-f171cd5245a8">
    <name>ДатаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f591f9ce-cc6e-447d-9dbb-d8f97d14b471">
    <name>ДлОбработкиМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b6867e51-27ef-412a-8310-5e541572a80d">
    <name>ТекстЖурнала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5ce30598-30ab-4cb8-8e33-07a80a4c3ca5">
    <name>КоличествоОбработок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d7d9478d-81b5-41b6-aef7-75804ffeda2f">
    <name>МеткаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="f5651cfa-879f-4b36-a83a-fd15928fdcb5">
    <name>КлючЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="111ca233-437e-423e-bb9a-fac72f0cf50c">
    <name>МеткаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/кфкИсходящиеСообщения/кфкИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9bb60e0f-842a-4fa4-ac2b-edd89101fe4a">
  <name>кфкИсходящиеСообщения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="6b53242f-90ec-4441-929d-e40a10912da1">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="645be078-31fe-4466-b372-8bb9bfa3f5be">
    <name>ИсходныеДанные</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c8b56203-f691-4ecb-baa5-349014dc183d">
    <name>ЭтоУдаление</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="219a3ae5-d22d-467d-b06a-ac34b1cb0b28">
    <name>КлючСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="afab001f-7c73-48bc-8796-c31e7bf52af0">
    <name>Заголовки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="bb437059-733a-4568-833f-93a08c527b14">
    <name>ТелоСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="edf8a9c9-f606-41ee-a73e-b96b0e7cca2a">
    <name>Продюсер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="999a4a8e-9e06-4003-bef9-df9a1040dd3c">
    <name>ТипОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="292b6eec-1780-46e7-8559-9493aa1ddb42">
    <name>ТипИсходныхДанных</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7c42290-9fd9-47f2-aab1-06ebdfba17ce">
    <name>КлючОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="46012b4d-4b78-4cbd-8d0d-18101a391f7f">
    <name>СобытиеРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95dd5ec5-8b2e-459f-a936-2a5d2be7b2a4">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28f1a3aa-a8a0-404d-97be-3f9ebb177a1a">
    <name>ДатаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee05bfa3-5c0b-4ad6-962d-b2ec05fed003">
    <name>ДатаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e799e980-8ada-4039-a30c-da9f60bebb2d">
    <name>ДлОбработкиМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a856e5db-41c4-4e7d-981e-2c56dcb0b477">
    <name>ТекстЖурнала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d139c82-f66c-4620-a76a-8cb29ad47bce">
    <name>КоличествоОбработок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="285c25ea-c7ab-4ec5-b049-028ac1a7e72d">
    <name>КоличествоВыгрузок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="aa816974-7fec-4c4a-a209-74cbe7e41026">
    <name>МеткаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="bc51b526-bde0-4420-be0b-4163f25aa1ed">
    <name>КлючЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="dcea6dff-ee4d-4454-ab67-2dff64dc7131">
    <name>МеткаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкСтатусыСообщений/кфкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="90c87861-83c3-4174-81dd-550f291515d7">
  <name>кфкСтатусыСообщений</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e87ed46a-b4fe-41ad-a05b-c7d43a993d59">
    <name>Новое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4aa47c21-1293-47d6-b3ab-9d29a043b1dc">
    <name>Обработано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82907498-6643-4090-a81d-dd1982638a68">
    <name>ОбработкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bb65cb4f-750e-4084-b787-633ed9393166">
    <name>ОшибкаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="31aa5e8e-008e-4e64-bdea-a9307ad0bcc1">
    <name>Выгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2aad9bb4-aca4-411a-8268-a2c8d7a9efe8">
    <name>ОшибкаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b1566b75-70c6-497a-8ff6-bdaa91eddbbe">
    <name>ВыгрузкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ОМ_кфкФоновыеОперацииСлужебный/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Регистрирует проверки раздела операции и непрерывного префикса пакетов.
Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ВТранзакции()
		.После("ПослеКаждогоТеста")
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. ПолучитьРазделОперации()")
			.Тег("ОбщийМодуль")
			.Тег("Модульные")
			.Тег("кфкФоновыеОперацииСлужебный")
			.Тег("ПолучитьРазделОперации")
			.Тег("Компонентные")
			.ДобавитьСерверныйТест("ПолучитьРазделОперации_НеЗависитОтПорядка",
				"ПолучитьРазделОперации(). Перестановка двух настроек сохраняет раздел")
				.Тег("СохраняетРазделПриПерестановке")
			.ДобавитьСерверныйТест("ПолучитьРазделОперации_РазличаетСостав",
				"ПолучитьРазделОперации(). Замена одной настройки меняет раздел")
				.Тег("РазличаетСоставНастроек")
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. ОбновитьУказательНачалаВыборки()")
			.Тег("ОбщийМодуль")
			.Тег("Модульные")
			.Тег("кфкФоновыеОперацииСлужебный")
			.Тег("ОбновитьУказательНачалаВыборки")
			.Тег("Компонентные")
			.ДобавитьСерверныйТест("ОбновитьУказательНачалаВыборки_УчитываетПрефикс",
				"ОбновитьУказательНачалаВыборки(). Учитывает только непрерывно завершенный префикс")
				.Тег("УчитываетНепрерывныйПрефикс")
				.СПараметрами(0, 0, 1000000, 2)
				.СПараметрами(0, 1, 1000000, 2)
				.СПараметрами(1, 0, 1100000, 1)
				.СПараметрами(1, 1, 2100000, 0)
			.ДобавитьСерверныйТест("ОбновитьУказательНачалаВыборки_ЖдетПервыйПакет",
				"ОбновитьУказательНачалаВыборки(). Ждет завершения первого пакета")
				.Тег("ЖдетПервыйПакет")
			.ДобавитьСерверныйТест("ОбновитьУказательНачалаВыборки_СортируетПакеты",
				"ОбновитьУказательНачалаВыборки(). Не зависит от порядка строк пакетов")
				.Тег("СортируетПакеты")
			.ДобавитьСерверныйТест("ОбновитьУказательНачалаВыборки_ИсчезнувшийПотокУдерживаетПозицию",
				"ОбновитьУказательНачалаВыборки(). Удерживает позицию при исчезновении потока")
				.Тег("ИсчезнувшийПотокУдерживаетПозицию")
			.ДобавитьСерверныйТест("ОбновитьУказательНачалаВыборки_РавныеМеткиНеСкрываютНезавершенныйПакет",
				"ОбновитьУказательНачалаВыборки(). Удерживает позицию при равных метках")
				.Тег("РавныеМеткиНеСкрываютНезавершенныйПакет")
			.ДобавитьСерверныйТест("ОбновитьУказательНачалаВыборки_ПустаяВыборкаНеОткатываетПозицию",
				"ОбновитьУказательНачалаВыборки(). Не откатывает позицию на пустой выборке")
				.Тег("ПустаяВыборкаНеОткатываетПозицию")
				.СПараметрами(900000, 1000000)
				.СПараметрами(1000000, 1000000)
				.СПараметрами(1200000, 1200000)
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. РаспределитьВыборкуПоПотокам()")
			.Тег("ОбщийМодуль")
			.Тег("Модульные")
			.Тег("кфкФоновыеОперацииСлужебный")
			.Тег("РаспределитьВыборкуПоПотокам")
			.Тег("Компонентные")
			.ДобавитьСерверныйТест("РаспределитьВыборкуПоПотокам_СохраняетКлючи",
				"РаспределитьВыборкуПоПотокам(). Сохраняет ключи полного пакета и хвоста")
				.Тег("СохраняетКлючиПриРазбиении")
				.СПараметрами(0, 2, 3, "")
				.СПараметрами(1, 2, 3, "1")
				.СПараметрами(2, 2, 3, "2")
				.СПараметрами(3, 2, 3, "2,1")
				.СПараметрами(5, 2, 3, "2,2,1")
				.СПараметрами(6, 2, 3, "3,3")
				.СПараметрами(7, 2, 3, "3,3,1")
				.СПараметрами(7, 2, 2, "2,2,2,1")
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. ХэшСуммаТела()")
			.Тег("ОбщийМодуль")
			.Тег("Модульные")
			.Тег("кфкФоновыеОперацииСлужебный")
			.Тег("ХэшСуммаТела")
			.ДобавитьСерверныйТест("ХэшСуммаТела_СоответствуетЭталону")
				.Тег("СоответствуетЭталону")
				.СПараметрами("", "e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855")
				.СПараметрами("616263", "ba7816bf8f01cfea414140de5dae2223b00361a396177a9cb410ff61f20015ad")
				.СПараметрами("616264", "a52d159f262b2c6ddb724a61840befc36eb30c88877a4030b65cbe86298449c9")
				.СПараметрами("d09fd180d0b8d0b2d0b5d182",
					"dd679c0b9fd408a04148aa7d30c9df393f67b7227f65693fffe0ed6d0f0ade59")
				.СПараметрами("00ff8041", "3507b01e644277ad3cd10dadd6e33cb801151e62e3cb899a67409ef701d6079c")
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. ДополнитьТекстЖурнала()")
			.Тег("ОбщийМодуль")
			.Тег("Модульные")
			.Тег("кфкФоновыеОперацииСлужебный")
			.Тег("ДополнитьТекстЖурнала")
			.ДобавитьСерверныйТест("ДополнитьЖурнал_НеПереноситПредыдущийВызов")
				.Тег("НеПереноситПредыдущиеДанные")
				.СПараметрами("", "", "")
				.СПараметрами("", "Новый", "Новый")
				.СПараметрами("Старый", "", "Старый")
				.СПараметрами(" Старый ", " Новый ",
					"Новый" + Символы.ПС + "--------------------------------------------------" + Символы.ПС + "Старый")
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. Повторное использование очередей")
			.Тег("ОбщийМодуль")
			.Тег("Модульные")
			.Тег("кфкФоновыеОперацииСлужебный")
			.Тег("ПовторноеИспользованиеОчередей")
			.ДобавитьСерверныйТест("НоваяОчередь_ОчищаетСтрокиИОтбор")
				.Тег("НоваяОчередь")
				.Тег("ОчищаетСтрокиИОтбор")
				.СПараметрами(Истина)
				.СПараметрами(Ложь)
			.ДобавитьСерверныйТест("НоваяОчередьПотока_ОчищаетСтрокиИОтбор")
				.Тег("НоваяОчередьПотока")
				.Тег("ОчищаетСтрокиИОтбор")
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. Поля логирования")
			.Тег("ОбщийМодуль")
			.Тег("Модульные")
			.Тег("кфкФоновыеОперацииСлужебный")
			.Тег("СериализацияЛога")
			.ДобавитьСерверныйТест("ЗаголовкиЛога_УчитываютТипИОпцию")
				.Тег("ДобавитьЗаголовкиСообщенияВЛог")
				.Тег("УчитываетТипИОпцию")
				.СПараметрами("abc", Истина, "x=abc")
				.СПараметрами(42, Истина, "x=42")
				.СПараметрами(Истина, Истина, "x=true")
				.СПараметрами(Новый Массив, Истина, Неопределено)
				.СПараметрами("abc", Ложь, Неопределено)
			.ДобавитьСерверныйТест("ЗаголовкиЛога_ПустойКонтейнерНеДобавляетПоле")
				.Тег("ДобавитьЗаголовкиСообщенияВЛог")
				.Тег("ПустыеЗаголовкиНеДобавляются")
			.ДобавитьСерверныйТест("ТелоЛога_УчитываетСодержимоеИОпцию")
				.Тег("ДобавитьТелоСообщенияВЛог")
				.Тег("УчитываетТелоИОпцию")
				.СПараметрами("", Истина, Неопределено)
				.СПараметрами("   ", Истина, Неопределено)
				.СПараметрами("тело", Истина, "тело")
				.СПараметрами("тело", Ложь, Неопределено)
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. Отправка логов")
			.Тег("ОбщийМодуль")
			.Тег("Модульные")
			.Тег("кфкФоновыеОперацииСлужебный")
			.Тег("ОтправкаЛогов")
			.ДобавитьСерверныйТест("ЛогированиеHTTP_ПередаетСобытияИОбрабатываетОтказ")
				.Тег("ОтправитьЛоги")
				.Тег("ПередаетСобытияИОбрабатываетОтказ")
				.Тег("МокHTTP")
			.ДобавитьСерверныйТест("ОповещениеTelegram_ИзолируетHTTPСоединение")
				.Тег("ОповеститьОбОшибки")
				.Тег("ИзолируетHTTPСоединение")
			.ДобавитьСерверныйТест("Логирование_СохраняетСобытие")
				.Тег("ОбработчикВыгрузкиЛоговИсходящихСообщений")
				.Тег("ОбработчикВыгрузкиЛоговВходящихСообщений")
				.Тег("СохраняетВнешнийКонтрактСобытия")
				.СПараметрами(Истина)
				.СПараметрами(Ложь)
			.ДобавитьСерверныйТест("Логирование_НеПерескакиваетРавныеМетки")
				.Тег("ОбработчикВыгрузкиЛоговИсходящихСообщений")
				.Тег("ОбработчикВыгрузкиЛоговВходящихСообщений")
				.Тег("НеПерескакиваетРавныеМетки")
				.СПараметрами(Истина)
				.СПараметрами(Ложь)
			.ДобавитьСерверныйТест("Логирование_ОшибкаУдерживаетПозицию")
				.Тег("ОбработчикВыгрузкиЛоговИсходящихСообщений")
				.Тег("ОбработчикВыгрузкиЛоговВходящихСообщений")
				.ВТранзакции(Ложь)
				.Тег("ОшибкаУдерживаетПозицию")
				.СПараметрами(Истина, 500, Ложь)
				.СПараметрами(Ложь, 500, Ложь)
				.СПараметрами(Истина, 200, Истина)
				.СПараметрами(Ложь, 200, Истина);

КонецПроцедуры

// Восстанавливает настройки внешних зависимостей после каждого теста.
Процедура ПослеКаждогоТеста() Экспорт

	Мокито.Сбросить();
	Контекст = ЮТест.КонтекстТеста();
	Если Контекст.Свойство("ют_HTTPСессияTelegram") Тогда
		Контекст.Удалить("ют_HTTPСессияTelegram");
		Контекст.Удалить("ют_TelegramСервер");
		Контекст.Удалить("ют_TelegramТаймаут");
		Контекст.Удалить("ют_TelegramTLS");
	КонецЕсли;

КонецПроцедуры

#Область ПозицииОпераций

// Проверяет раздел операции на двух разных сохраненных настройках без повторения алгоритма хеширования.
Процедура ПолучитьРазделОперации_НеЗависитОтПорядка() Экспорт

	Первый = НовыйПродюсер("Первый");
	Второй = НовыйПродюсер("Второй");

	Исходный = кфкФоновыеОперацииСлужебный.ют_РазделОперации(НастройкиОперации(Первый, Второй));
	Переставленный = кфкФоновыеОперацииСлужебный.ют_РазделОперации(НастройкиОперации(Второй, Первый));

	ЮТест.ОжидаетЧто(Исходный.Значение, "раздел не зависит от порядка настроек")
		.Равно(Переставленный.Значение);
	ЮТест.ОжидаетЧто(Исходный.Значение, "раздел двух настроек заполнен").НеРавно("");

КонецПроцедуры

// Проверяет раздел операции при замене одного элемента состава без вычисления ожидаемой хеш-суммы.
Процедура ПолучитьРазделОперации_РазличаетСостав() Экспорт

	Первый = НовыйПродюсер("Первый");
	Второй = НовыйПродюсер("Второй");
	Третий = НовыйПродюсер("Третий");

	Исходный = кфкФоновыеОперацииСлужебный.ют_РазделОперации(НастройкиОперации(Первый, Второй));
	Измененный = кфкФоновыеОперацииСлужебный.ют_РазделОперации(НастройкиОперации(Первый, Третий));

	ЮТест.ОжидаетЧто(Исходный.Значение, "разные составы настроек имеют разные разделы")
		.НеРавно(Измененный.Значение);

КонецПроцедуры
// Проверяет только непрерывно завершенные пакеты разрешают продвижение.
//
// Параметры:
//  ПервыйЗавершен - Число - статус первого пакета: 0 или 1.
//  ВторойЗавершен - Число - статус второго пакета: 0 или 1.
//  ОжидаемаяПозиция - Число - независимо заданная граница в миллисекундах.
//  ОсталосьПакетов - Число - число неучтенных пакетов.
Процедура ОбновитьУказательНачалаВыборки_УчитываетПрефикс(
	ПервыйЗавершен, ВторойЗавершен, ОжидаемаяПозиция, ОсталосьПакетов) Экспорт

	Сценарий = НовыйСценарийПозиции(ПервыйЗавершен, ВторойЗавершен);
	Позиция = Сценарий.Позиция;

	кфкФоновыеОперацииСлужебный.ют_ОбновитьУказательНачалаВыборки(
		Позиция, Сценарий.Указатели, 4000000, Сценарий.Потоки, Сценарий.Операция, Сценарий.Раздел);
	Сценарий.Позиция = Позиция;

	ПроверитьСценарийПозиции(Сценарий, ОжидаемаяПозиция, ОсталосьПакетов);

КонецПроцедуры
// Проверяет обратное завершение не подтверждает необработанный первый пакет.
Процедура ОбновитьУказательНачалаВыборки_ЖдетПервыйПакет() Экспорт

	Сценарий = НовыйСценарийПозиции(0, 1);
	Позиция = Сценарий.Позиция;

	кфкФоновыеОперацииСлужебный.ют_ОбновитьУказательНачалаВыборки(
		Позиция, Сценарий.Указатели, 4000000, Сценарий.Потоки, Сценарий.Операция, Сценарий.Раздел);
	Сценарий.Позиция = Позиция;

	ПроверитьСценарийПозиции(Сценарий, 1000000, 2);
	Сценарий.Указатели[0].СтатусПотока = 1;

	кфкФоновыеОперацииСлужебный.ют_ОбновитьУказательНачалаВыборки(
		Позиция, Сценарий.Указатели, 4000000, Сценарий.Потоки, Сценарий.Операция, Сценарий.Раздел);
	Сценарий.Позиция = Позиция;

	ПроверитьСценарийПозиции(Сценарий, 2100000, 0);

КонецПроцедуры
// Проверяет порядок строк указателей не меняет границу завершенного префикса.
Процедура ОбновитьУказательНачалаВыборки_СортируетПакеты() Экспорт

	Сценарий = НовыйСценарийПозиции(1, 0);
	Сценарий.Указатели.Сортировать("ВременнаяМетка Убыв");
	Позиция = Сценарий.Позиция;

	кфкФоновыеОперацииСлужебный.ют_ОбновитьУказательНачалаВыборки(
		Позиция, Сценарий.Указатели, 4000000, Сценарий.Потоки, Сценарий.Операция, Сценарий.Раздел);
	Сценарий.Позиция = Позиция;

	ПроверитьСценарийПозиции(Сценарий, 1100000, 1);
	ЮТест.ОжидаетЧто(Сценарий.Указатели[0].ВременнаяМетка,
		"незавершенный второй пакет остается назначенным").Равно(3000000);

КонецПроцедуры
// Проверяет исчезновение первого потока не подтверждает завершенный хвост.
Процедура ОбновитьУказательНачалаВыборки_ИсчезнувшийПотокУдерживаетПозицию() Экспорт

	Сценарий = НовыйСценарийПозиции(0, 1);
	Сценарий.Потоки.Удалить(0);
	Позиция = Сценарий.Позиция;

	кфкФоновыеОперацииСлужебный.ют_ОбновитьУказательНачалаВыборки(
		Позиция, Сценарий.Указатели, 4000000, Сценарий.Потоки, Сценарий.Операция, Сценарий.Раздел);
	Сценарий.Позиция = Позиция;

	ПроверитьСценарийПозиции(Сценарий, 1000000, 1);
	ЮТест.ОжидаетЧто(Сценарий.Указатели[0].ИдентификаторПотока,
		"завершенный хвост не потерян").Равно(Сценарий.Потоки[0]);

КонецПроцедуры
// Проверяет равная временная метка не позволяет подтвердить незавершенный пакет.
Процедура ОбновитьУказательНачалаВыборки_РавныеМеткиНеСкрываютНезавершенныйПакет() Экспорт

	Сценарий = НовыйСценарийПозиции(0, 1);
	Сценарий.Указатели[1].ВременнаяМетка = 2000000;
	Позиция = Сценарий.Позиция;

	кфкФоновыеОперацииСлужебный.ют_ОбновитьУказательНачалаВыборки(
		Позиция, Сценарий.Указатели, 4000000, Сценарий.Потоки, Сценарий.Операция, Сценарий.Раздел);
	Сценарий.Позиция = Позиция;

	ПроверитьСценарийПозиции(Сценарий, 1000000, 2);

КонецПроцедуры
// Проверяет пустая выборка продвигает позицию только вперед.
//
// Параметры:
//  ПустаяВыборка - Число - новая граница в миллисекундах.
//  ОжидаемаяПозиция - Число - независимый эталон результата.
Процедура ОбновитьУказательНачалаВыборки_ПустаяВыборкаНеОткатываетПозицию(
	ПустаяВыборка, ОжидаемаяПозиция) Экспорт

	Сценарий = НовыйСценарийПозиции(0, 0);
	Сценарий.Указатели.Очистить();
	Сценарий.Потоки.Очистить();
	Позиция = Сценарий.Позиция;

	кфкФоновыеОперацииСлужебный.ют_ОбновитьУказательНачалаВыборки(
		Позиция, Сценарий.Указатели, ПустаяВыборка, Сценарий.Потоки, Сценарий.Операция, Сценарий.Раздел);
	Сценарий.Позиция = Позиция;

	ПроверитьСценарийПозиции(Сценарий, ОжидаемаяПозиция, 0);

КонецПроцедуры

#КонецОбласти

#Область РаспределениеПакетов

// Проверяет сохранность ключей и границы пакетов.
// Параметры:
//  Количество - Число - число исходных сообщений.
//  Минимум - Число - нижняя граница пакета.
//  Максимум - Число - верхняя граница пакета.
//  Размеры - Строка - независимый эталон размеров пакетов через запятую.
Процедура РаспределитьВыборкуПоПотокам_СохраняетКлючи(Количество, Минимум, Максимум, Размеры) Экспорт

	Источник = Новый УникальныйИдентификатор;
	ПервыйПоток = Новый УникальныйИдентификатор;
	ВторойПоток = Новый УникальныйИдентификатор;
	Потоки = Новый Массив; // Массив Из УникальныйИдентификатор
	Потоки.Добавить(ПервыйПоток);
	Потоки.Добавить(ВторойПоток);
	Исходные = НоваяОчередьПакетов(Источник, Количество);
	Выборка = ВыборкаОчередиПакетов(Источник);
	Очередь = РегистрыСведений.кфкОчередьПотоков.СоздатьНаборЗаписей();
	Указатели = кфкФоновыеОперацииСлужебный.ют_НовыеУказателиПотоков();
	Настройки = Новый Структура;
	Настройки.Вставить("МинРазмерПакета", Минимум);
	Настройки.Вставить("МаксРазмерПакета", Максимум);
	Настройки.Вставить("ИмяПоляВременнойМетки", "ВременнаяМетка");
	Настройки.Вставить("Указатели", Указатели);

	Мокито.Обучение(кфкФоновыеОперацииСлужебный)
		.Когда("ОжидатьСвободныеПотоки")
			.Вернуть(Потоки);
	Мокито.Прогон();

	кфкФоновыеОперацииСлужебный.ют_РаспределитьВыборкуПоПотокам(
		Выборка, Новый Структура, Потоки, 2, Неопределено, Очередь, Настройки);

	ЮТест.ОжидаетЧто(Очередь.Количество(), "записанный буфер очищен").Равно(0);
	ПроверитьНазначенияПакетов(Исходные, Потоки, Размеры, Указатели);

КонецПроцедуры

#КонецОбласти

#Область ПовторноеИспользованиеДанных

// Проверяет SHA256 по независимым опубликованным векторам байтов.
// Параметры:
//  ДанныеHex - Строка - входные байты в шестнадцатеричной форме.
//  ОжидаемыйХэш - Строка - независимый эталон SHA256.
Процедура ХэшСуммаТела_СоответствуетЭталону(ДанныеHex, ОжидаемыйХэш) Экспорт

	Данные = ПолучитьДвоичныеДанныеИзHexСтроки(ДанныеHex);

	Результат = кфкФоновыеОперацииСлужебный.ют_ХэшСуммаТела(Данные);

	ЮТест.ОжидаетЧто(НРег(Результат), "SHA256 байтов").Равно(ОжидаемыйХэш);

КонецПроцедуры

// Проверяет дополнение журнала и отсутствие остатка предыдущего вызова.
// Параметры:
//  Исходный - Строка - предыдущий журнал.
//  НовыйТекст - Строка - добавляемый текст.
//  Ожидаемый - Строка - независимый эталон объединения.
Процедура ДополнитьЖурнал_НеПереноситПредыдущийВызов(Исходный, НовыйТекст, Ожидаемый) Экспорт

	Результат = кфкФоновыеОперацииСлужебный.ют_ДополнитьЖурнал(Исходный, НовыйТекст);
	Следующий = кфкФоновыеОперацииСлужебный.ют_ДополнитьЖурнал("", "Независимое событие");

	ЮТест.ОжидаетЧто(Результат, "содержимое журнала").Равно(Ожидаемый);
	ЮТест.ОжидаетЧто(Следующий, "следующий журнал не содержит предыдущий")
		.Равно("Независимое событие");

КонецПроцедуры

// Проверяет повторное использование буфера сообщений в обоих направлениях.
// Параметры:
//  Входящие - Булево - направление очереди.
Процедура НоваяОчередь_ОчищаетСтрокиИОтбор(Входящие) Экспорт

	Очереди = ?(Входящие,
		кфкФоновыеОперацииСлужебный.ют_ОчередиВходящих(),
		кфкФоновыеОперацииСлужебный.ют_ОчередиИсходящих());
	Буфер = кфкФоновыеОперацииСлужебный.ют_НоваяОчередь(Очереди);
	СтарыйКлюч = Строка(Новый УникальныйИдентификатор);
	НовыйКлюч = Строка(Новый УникальныйИдентификатор);
	СтараяМетка = 987654321;
	Буфер.Отбор.КлючЗаписи.Установить(СтарыйКлюч);
	СтараяСтрока = Буфер.Добавить();
	СтараяСтрока.КлючЗаписи = СтарыйКлюч;
	СтараяСтрока.МеткаИзмененияМС = СтараяМетка;

	Повторный = кфкФоновыеОперацииСлужебный.ют_НоваяОчередь(Очереди);

	ЮТест.ОжидаетЧто(Повторный.Количество(), "старые строки очищены").Равно(0);
	ЮТест.ОжидаетЧто(Повторный.Отбор.КлючЗаписи.Использование, "старый отбор сброшен").Равно(Ложь);
	НоваяСтрока = Повторный.Добавить();
	НоваяСтрока.КлючЗаписи = НовыйКлюч;
	ЮТест.ОжидаетЧто(НоваяСтрока.МеткаИзмененияМС,
		"новая строка не наследует старую метку").Равно(0);
	Повторный.Записать(РежимЗамещения.Добавление);
	ИмяТаблицы = ?(Входящие, "РегистрСведений.кфкВходящиеСообщения",
		"РегистрСведений.кфкИсходящиеСообщения");
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяТаблицы)
		.СодержитТолькоОднуЗапись(ЮТест.Предикат()
			.Реквизит("КлючЗаписи").Равно(НовыйКлюч)
			.Реквизит("МеткаИзмененияМС").Равно(0));
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяТаблицы)
		.НеСодержитЗаписи(ЮТест.Предикат().Реквизит("КлючЗаписи").Равно(СтарыйКлюч));
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяТаблицы)
		.НеСодержитЗаписи(ЮТест.Предикат()
			.Реквизит("КлючЗаписи").Равно(НовыйКлюч)
			.Реквизит("МеткаИзмененияМС").Равно(СтараяМетка));

КонецПроцедуры

// Проверяет очистку назначения и фильтра перед повторным использованием буфера потока.
Процедура НоваяОчередьПотока_ОчищаетСтрокиИОтбор() Экспорт

	Очереди = кфкФоновыеОперацииСлужебный.ют_ОчередиИсходящих();
	Буфер = кфкФоновыеОперацииСлужебный.ют_НоваяОчередьПотока(Очереди);
	СтарыйПоток = Новый УникальныйИдентификатор;
	НовыйПоток = Новый УникальныйИдентификатор;
	Контроль = НоваяОчередьПакетов(Новый УникальныйИдентификатор, 1);
	Буфер.Отбор.ИдентификаторПотока.Установить(СтарыйПоток);
	Буфер.Добавить().ИдентификаторПотока = СтарыйПоток;

	Повторный = кфкФоновыеОперацииСлужебный.ют_НоваяОчередьПотока(Очереди);

	ЮТест.ОжидаетЧто(Повторный.Количество()).Равно(0);
	ЮТест.ОжидаетЧто(Повторный.Отбор.ИдентификаторПотока.Использование).Равно(Ложь);
	Запись = Повторный.Добавить();
	Запись.Ключ = Строка(НовыйПоток);
	Запись.ВременнаяМетка = 2000000;
	Запись.ИдентификаторПотока = НовыйПоток;
	Повторный.Записать(РежимЗамещения.Добавление);
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкОчередьПотоков")
		.СодержитТолькоОднуЗапись(
			ЮТест.Предикат().Реквизит("ИдентификаторПотока").Равно(НовыйПоток)
				.Реквизит("Ключ").Равно(Строка(НовыйПоток)).Реквизит("ВременнаяМетка").Равно(2000000));
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкОчередьПотоков")
		.НеСодержитЗаписи(ЮТест.Предикат().Реквизит("ИдентификаторПотока").Равно(СтарыйПоток));
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкОчередьПотоков")
		.СодержитТолькоОднуЗапись(
			ЮТест.Предикат().Реквизит("Ключ").Равно(Контроль[0].Ключ)
				.Реквизит("ВременнаяМетка").Равно(Контроль[0].ВременнаяМетка)
				.Реквизит("ИдентификаторПотока").Равно(Контроль[0].ИдентификаторПотока));

КонецПроцедуры

#КонецОбласти

#Область ПоляЛогирования

// Проверяет контракт сериализации заголовков лога.
// Параметры:
//  Значение - Строка, Число, Булево, Массив Из Произвольный - значение заголовка.
//  Добавлять - Булево - опция включения заголовков.
//  Ожидаемый - Строка, Неопределено - представление или отсутствие поля.
Процедура ЗаголовкиЛога_УчитываютТипИОпцию(Значение, Добавлять, Ожидаемый) Экспорт

	Заголовки = Новый Соответствие; // Соответствие Из Произвольный
	Заголовки.Вставить("x", Значение);
	Событие = Новый Соответствие; // Соответствие Из Произвольный

	кфкФоновыеОперацииСлужебный.ют_ЗаголовкиВЛог(
		Событие, кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Заголовки), Добавлять);

	ЮТест.ОжидаетЧто(Событие.Получить("msg_headers"), "поле заголовков лога").Равно(Ожидаемый);

КонецПроцедуры

// Проверяет отсутствие заголовков при пустом исходном контейнере.
Процедура ЗаголовкиЛога_ПустойКонтейнерНеДобавляетПоле() Экспорт

	Заголовки = Новый Соответствие; // Соответствие Из Строка
	Событие = Новый Соответствие; // Соответствие Из Произвольный

	кфкФоновыеОперацииСлужебный.ют_ЗаголовкиВЛог(
		Событие, кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Заголовки), Истина);

	ЮТест.ОжидаетЧто(Событие.Количество()).Равно(0);

КонецПроцедуры

// Проверяет включение тела и сохранение его содержимого в событии лога.
// Параметры:
//  Тело - Строка - исходный текст сообщения.
//  Добавлять - Булево - опция включения тела.
//  Ожидаемый - Строка, Неопределено - ожидаемое содержимое поля.
Процедура ТелоЛога_УчитываетСодержимоеИОпцию(Тело, Добавлять, Ожидаемый) Экспорт

	Событие = Новый Соответствие; // Соответствие Из Произвольный

	кфкФоновыеОперацииСлужебный.ют_ТелоВЛог(
		Событие, кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Тело), Добавлять);

	ЮТест.ОжидаетЧто(Событие.Получить("msg_body"), "тело лога").Равно(Ожидаемый);

КонецПроцедуры

#КонецОбласти

#Область ОтправкаЛогов

// Проверяет сформированный HTTP-запрос и обработку ответа через подставленную сессию.
Процедура ЛогированиеHTTP_ПередаетСобытияИОбрабатываетОтказ() Экспорт

	Контекст = ЮТест.КонтекстТеста();
	Контекст.Вставить("ют_HTTPКод", 200);
	Сессия = ОМ_кфкФоновыеОперацииСлужебный;
	События = Новый Массив; // Массив Из Соответствие
	Событие = Новый Соответствие; // Соответствие Из Строка
	Событие.Вставить("marker", "success");
	События.Добавить(Событие);
	Параметры = Новый Структура("АдресСервисаЧасти",
		ОбщегоНазначенияКлиентСервер.СтруктураURI("http://unit.invalid/unit/logs/success"));

	кфкФоновыеОперацииСлужебный.ют_ОтправитьЛоги(Параметры, События, Сессия);

	ЮТест.ОжидаетЧто(Контекст.ют_HTTPМетод).Равно("POST");
	Запрос = Контекст.ют_HTTPЗапрос; // HTTPЗапрос
	ЮТест.ОжидаетЧто(Запрос.АдресРесурса).Равно("unit/logs/success");
	ЮТест.ОжидаетЧто(Запрос.Заголовки.Получить("Content-Type")).Равно("application/json");
	ЮТест.ОжидаетЧто(Запрос.Заголовки.Получить("Content-encoding")).Равно("gzip");
	ПолученныеСобытия = СобытияПерехваченногоЛога();
	ЮТест.ОжидаетЧто(ПолученныеСобытия).ИмеетДлину(1);
	ЮТест.ОжидаетЧто(ПолученныеСобытия[0].Получить("marker")).Равно("success");

	Контекст.Вставить("ют_HTTPКод", 500);
	Параметры.АдресСервисаЧасти = ОбщегоНазначенияКлиентСервер.СтруктураURI(
		"http://unit.invalid/unit/logs/failure");
	События.Очистить();
	Событие = Новый Соответствие; // Соответствие Из Строка
	Событие.Вставить("marker", "failure");
	События.Добавить(Событие);
	ЮТест.ОжидаетЧто(кфкФоновыеОперацииСлужебный)
		.Метод("ют_ОтправитьЛоги", ЮТМетоды.МассивПараметров(Параметры, События, Сессия))
			.ВыбрасываетИсключение("500");

	ЮТест.ОжидаетЧто(Контекст.ют_HTTPМетод).Равно("POST");
	Запрос = Контекст.ют_HTTPЗапрос; // HTTPЗапрос
	ЮТест.ОжидаетЧто(Запрос.АдресРесурса).Равно("unit/logs/failure");
	ЮТест.ОжидаетЧто(Запрос.Заголовки.Получить("Content-Type")).Равно("application/json");
	ЮТест.ОжидаетЧто(Запрос.Заголовки.Получить("Content-encoding")).Равно("gzip");
	ПолученныеСобытия = СобытияПерехваченногоЛога();
	ЮТест.ОжидаетЧто(ПолученныеСобытия).ИмеетДлину(1);
	ЮТест.ОжидаетЧто(ПолученныеСобытия[0].Получить("marker")).Равно("failure");

КонецПроцедуры
// Проверяет Telegram-запрос через подставленную HTTP-сессию без внешнего вызова.
Процедура ОповещениеTelegram_ИзолируетHTTPСоединение() Экспорт

	Контекст = ЮТест.КонтекстТеста();
	Контекст.Вставить("ют_HTTPСессияTelegram", ОМ_кфкФоновыеОперацииСлужебный);
	Параметры = Новый Структура("ИдентификаторЧатаТГ,ТокенБотаТГ", "chat-42", "unit-token");
	Текст = "Ошибка #1";

	кфкФоновыеОперацииСлужебный.ют_ОповеститьОбОшибки(Параметры, Текст);

	ЮТест.ОжидаетЧто(Контекст.ют_TelegramСервер).Равно("api.telegram.org");
	ЮТест.ОжидаетЧто(Контекст.ют_TelegramТаймаут).Равно(60);
	ЮТест.ОжидаетЧто(ТипЗнч(Контекст.ют_TelegramTLS))
		.Равно(Тип("ЗащищенноеСоединениеOpenSSL"));
	ЮТест.ОжидаетЧто(Контекст.ют_HTTPМетод).Равно("POST");
	Запрос = Контекст.ют_HTTPЗапрос; // HTTPЗапрос
	ЮТест.ОжидаетЧто(Запрос.АдресРесурса).Равно("/botunit-token/sendMessage");
	ЮТест.ОжидаетЧто(Запрос.Заголовки.Получить("Content-Type"))
		.Равно("application/json;charset=utf-8");
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	ЮТест.ОжидаетЧто(СтрНайти(ТелоЗапроса, """chat_id"":""chat-42""") > 0).Равно(Истина);
	ЮТест.ОжидаетЧто(СтрНайти(ТелоЗапроса, """text"":""Ошибка #1""") > 0).Равно(Истина);
	ЮТест.ОжидаетЧто(СтрНайти(ТелоЗапроса, """parse_mode"":""Markdown""") > 0).Равно(Истина);

КонецПроцедуры
// Проверяет полный внешний эталон события и успешное продвижение позиции.
// Параметры:
//  Входящие - Булево - направление логирования.
Процедура Логирование_СохраняетСобытие(Входящие) Экспорт

	Начало = (Дата(2100, 1, 1) - Дата(1, 1, 1)) * 1000;
	Данные = НовоеСообщениеЛога(Входящие, Начало + 100);
	Представления = Новый Соответствие; // Соответствие Из Строка
	Представления.Вставить(Данные.Настройка, "Имя настройки");
	ЗафиксироватьЧасыЛога(Начало + 1000);
	Выборка = ВыборкаЛогаТеста(Входящие, 1, Начало);
	Позиция = Начало;

	ОбработатьЛогиТеста(Входящие, Выборка, Представления, Позиция);

	События = СобытияПерехваченногоЛога();
	ЮТест.ОжидаетЧто(События.Количество(), "одно событие для одной записи").Равно(1);
	Ожидаемый = ЭталонСобытияЛога(Входящие, Данные);
	Фактический = События[0];
	ЮТест.ОжидаетЧто(Фактический.Количество(), "точный состав полей")
		.Равно(Ожидаемый.Количество());
	Для Каждого Поле Из Ожидаемый Цикл
		ЮТест.ОжидаетЧто(Фактический.Получить(Поле.Ключ), "" + Поле.Ключ).Равно(Поле.Значение);
	КонецЦикла;
	ЮТест.ОжидаетЧто(Позиция, "успех продвигает позицию").Равно(Начало + 100);
	ЮТест.ОжидаетЧто(ЮТест.КонтекстТеста().ют_HTTPМетод).Равно("POST");
	Запрос = ЮТест.КонтекстТеста().ют_HTTPЗапрос; // HTTPЗапрос
	ЮТест.ОжидаетЧто(Запрос.АдресРесурса).Равно("unit/logs/component");
	ЮТест.ОжидаетЧто(Запрос.Заголовки.Получить("Content-Type")).Равно("application/json");
	ЮТест.ОжидаетЧто(Запрос.Заголовки.Получить("Content-encoding")).Равно("gzip");

КонецПроцедуры

// Проверяет сохраненную позицию и повтор события после отказа HTTP.
// Параметры:
//  Входящие - Булево - направление.
//  Код - Число - код ответа тестовой HTTP-сессии.
//  Разрыв - Булево - выбросить исключение на транспортной границе.
Процедура Логирование_ОшибкаУдерживаетПозицию(Входящие, Код, Разрыв) Экспорт

	ПрежнееЛогирование = РегистрыСведений.кфкПараметрыЛогирования.СоздатьНаборЗаписей();
	ПрежнееЛогирование.Прочитать();
	ПрежняяБлокировка = Константы.кфкБлокировкаИнтеграции.Получить();
	Контекст = ЮТест.КонтекстТеста();
	Контекст.Вставить("ют_HTTPКод", Код);
	Контекст.Вставить("ют_HTTPИсключение", Разрыв);
	Контекст.Вставить("ют_HTTPСессияЛогирования", ОМ_кфкФоновыеОперацииСлужебный);

	Попытка
		// Функциональная опция должна видеть настройки до начала транзакции фикстуры.
		Настройки = РегистрыСведений.кфкПараметрыЛогирования.СоздатьМенеджерЗаписи();
		Настройки.Прочитать();
		Настройки.Использовать = Истина;
		Настройки.АдресСервиса = "http://127.0.0.1:18769/unit/logs/component";
		Настройки.Записать();
		Константы.кфкБлокировкаИнтеграции.Установить(Ложь);
		ОбновитьПовторноИспользуемыеЗначения();

		НачатьТранзакцию();
		Попытка
			Начало = (Дата(2100, 1, 1) - Дата(1, 1, 1)) * 1000;
			Данные = НовоеСообщениеЛога(Входящие, Начало + 100);
			ИДОперации = Новый УникальныйИдентификатор(?(Входящие,
				"00000000-0001-0000-0000-222222222222", "00000000-0001-0000-0000-111111111111"));
			РегистрыСведений.кфкПозицииОпераций.ОбновитьПозицию(ИДОперации, Начало);
			ЗафиксироватьЧасыЛога(Начало + 1000);
			ИмяОперации = ?(Входящие, "ВыгрузкаЛоговВходящихСообщений", "ВыгрузкаЛоговИсходящихСообщений");
			ОжидаемаяОшибка = ?(Разрыв, "unit: разрыв HTTP-соединения", Строка(Код));

			ЮТест.ОжидаетЧто(кфкФоновыеОперацииСлужебный)
				.Метод(ИмяОперации)
				.ВыбрасываетИсключение(ОжидаемаяОшибка);

			Условие = ЮТест.Предикат()
				.Реквизит("Идентификатор").Равно(ИДОперации)
				.Реквизит("Раздел").Равно("")
				.Реквизит("ВременнаяМетка").Равно(Начало);
			ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкПозицииОпераций")
				.СодержитЗаписи(Условие);
			Позиция = РегистрыСведений.кфкПозицииОпераций.ПолучитьПозицию(ИДОперации);
			Повтор = ВыборкаЛогаТеста(Входящие, 1, Позиция);
			ЮТест.ОжидаетЧто(Повтор.Количество(), "событие доступно для повтора").Равно(1);
			Повтор.Следующий();
			ЮТест.ОжидаетЧто(Повтор.КлючЗаписи, "повторяется неподтвержденное событие").Равно(Данные.Ключ);
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		ОтменитьТранзакцию();
	Исключение
		ПрежнееЛогирование.Записать();
		Константы.кфкБлокировкаИнтеграции.Установить(ПрежняяБлокировка);
		ОбновитьПовторноИспользуемыеЗначения();
		Контекст.Удалить("ют_HTTPСессияЛогирования");
		ВызватьИсключение;
	КонецПопытки;

	ПрежнееЛогирование.Записать();
	Константы.кфкБлокировкаИнтеграции.Установить(ПрежняяБлокировка);
	ОбновитьПовторноИспользуемыеЗначения();
	Контекст.Удалить("ют_HTTPСессияЛогирования");

КонецПроцедуры

// Проверяет сохранение хвоста при одинаковых метках на границе порции.
// Параметры:
//  Входящие - Булево - направление.
Процедура Логирование_НеПерескакиваетРавныеМетки(Входящие) Экспорт

	ЮТест.Пропустить("Ошибка продукта: теряется хвост логов с равной меткой времени на границе порции");

	Начало = (Дата(2100, 1, 1) - Дата(1, 1, 1)) * 1000;
	Первое = НовоеСообщениеЛога(Входящие, Начало + 100);
	Второе = НовоеСообщениеЛога(Входящие, Начало + 100);
	Представления = Новый Соответствие; // Соответствие Из Строка
	Представления.Вставить(Первое.Настройка, "Первая настройка");
	Представления.Вставить(Второе.Настройка, "Вторая настройка");
	ЗафиксироватьЧасыЛога(Начало + 1000);
	Позиция = Начало;
	Выборка = ВыборкаЛогаТеста(Входящие, 1, Позиция);

	ОбработатьЛогиТеста(Входящие, Выборка, Представления, Позиция);

	ПервыйПакет = СобытияПерехваченногоЛога();
	ЮТест.ОжидаетЧто(ПервыйПакет.Количество()).Равно(1);
	Хвост = ВыборкаЛогаТеста(Входящие, 1, Позиция);
	ЮТест.ОжидаетЧто(Хвост.Количество(), "второе событие с той же меткой осталось доступно").Равно(1);
	ОбработатьЛогиТеста(Входящие, Хвост, Представления, Позиция);
	ВторойПакет = СобытияПерехваченногоЛога();
	ЮТест.ОжидаетЧто(ВторойПакет.Количество()).Равно(1);
	ЮТест.ОжидаетЧто(ВторойПакет[0].Получить("record_key"), "хвост не повторяет первое событие")
		.НеРавно(ПервыйПакет[0].Получить("record_key"));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТестов

// Тестовая HTTP-сессия: сохраняет запрос и возвращает управляемый исход.
// Параметры:
//  Метод - Строка - HTTP-метод.
//  Запрос - HTTPЗапрос - сформированный запрос.
// Возвращаемое значение:
//  Структура - ответ тестовой сессии:
//   * КодСостояния - Число - заданный код ответа.
Функция ВызватьHTTPМетод(Метод, Запрос) Экспорт

	Контекст = ЮТест.КонтекстТеста();
	Контекст.Вставить("ют_HTTPМетод", Метод);
	Контекст.Вставить("ют_HTTPЗапрос", Запрос);
	Если Контекст.Свойство("ют_HTTPИсключение") И Контекст.ют_HTTPИсключение Тогда
		ВызватьИсключение "unit: разрыв HTTP-соединения";
	КонецЕсли;
	Код = 200;
	Если Контекст.Свойство("ют_HTTPКод") Тогда
		Код = Контекст.ют_HTTPКод;
	КонецЕсли;

	Возврат Новый Структура("КодСостояния", Код);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает сохраненную строку журнала с фиксированными единицами времени.
// Параметры:
//  Входящие - Булево - направление сообщения.
//  Метка - Число - время изменения от начала календаря в миллисекундах.
// Возвращаемое значение:
//  Структура - данные собственного события:
//   * Ключ - Строка - идентификатор записи.
//   * Настройка - СправочникСсылка.кфкПродюсеры, СправочникСсылка.кфкКонсьюмеры - адресат.
//   * Начало - Число - начало 2100 года в миллисекундах.
Функция НовоеСообщениеЛога(Входящие, Метка)

	Начало = (Дата(2100, 1, 1) - Дата(1, 1, 1)) * 1000;
	Ключ = Строка(Новый УникальныйИдентификатор);
	Заголовки = Новый Соответствие; // Соответствие Из Строка
	Заголовки.Вставить("trace", "unit-log");

	Если Входящие Тогда
		Настройка = Справочники.кфкКонсьюмеры.ПолучитьСсылку(Новый УникальныйИдентификатор);
		Запись = РегистрыСведений.кфкВходящиеСообщения.СоздатьМенеджерЗаписи();
		Запись.Консьюмер = Настройка;
		Запись.ДатаЗагрузкиМС = Начало;
		Запись.ДатаЗагрузки = Дата(2100, 1, 1);
		Запись.ДатаЗаписи = Дата(2100, 1, 1);
		Запись.Топик = "unit-log-topic";
		Запись.Раздел = 2;
		Запись.Смещение = 17;
		Запись.Статус = Перечисления.кфкСтатусыСообщений.Обработано;
	Иначе
		Настройка = Справочники.кфкПродюсеры.ПолучитьСсылку(Новый УникальныйИдентификатор);
		Запись = РегистрыСведений.кфкИсходящиеСообщения.СоздатьМенеджерЗаписи();
		Запись.Продюсер = Настройка;
		Запись.ДатаРегистрацииМС = Начало;
		Запись.ДатаРегистрации = Дата(2100, 1, 1);
		Запись.ТипОбъект = "Документ.Заказ";
		Запись.ТипИсходныхДанных = "Строка";
		Запись.КлючОбъекта = "object-17";
		Запись.ИсходныеДанные = Новый ХранилищеЗначения("<x>данные</x>");
		Запись.ЭтоУдаление = Истина;
		Запись.Статус = Перечисления.кфкСтатусыСообщений.Выгружено;
		Запись.КоличествоВыгрузок = 3;
	КонецЕсли;
	Запись.КлючЗаписи = Ключ;
	Запись.КлючСообщения = "message-17";
	Запись.ТелоСообщения = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище("тело сообщения");
	Запись.Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Заголовки);
	Запись.МеткаИзмененияМС = Метка;
	Запись.ТекстЖурнала = "исходный журнал";
	Запись.ДлОбработкиМС = 123;
	Запись.КоличествоОбработок = 2;
	Запись.Записать();

	Возврат Новый Структура("Ключ,Настройка,Начало", Ключ, Настройка, Начало);

КонецФункции

// Создает неизменные параметры сериализации событий лога.
// Возвращаемое значение:
//  Структура - префикс, флаги включения полей и разобранный адрес сервиса.
Функция ПараметрыЛогаТеста()

	Результат = Новый Структура;
	Результат.Вставить("Префикс", "unit");
	Результат.Вставить("ВыгружатьЗаголовкиСообщенияИсходящих", Истина);
	Результат.Вставить("ВыгружатьЗаголовкиСообщенияВходящих", Истина);
	Результат.Вставить("ВыгружатьТелоСообщенияИсходящих", Истина);
	Результат.Вставить("ВыгружатьТелоСообщенияВходящие", Истина);
	Результат.Вставить("ВыгружатьИсходныеДанныеИсходящих", Истина);
	Результат.Вставить("АдресСервисаЧасти",
		ОбщегоНазначенияКлиентСервер.СтруктураURI("http://127.0.0.1:18769/unit/logs/component"));

	Возврат Результат;

КонецФункции

// Фиксирует только часы внешней границы выборки логов.
// Параметры:
//  ВерхняяГраница - Число - верхняя граница выборки.
Процедура ЗафиксироватьЧасыЛога(ВерхняяГраница)

	Мокито.Обучение(кфкФоновыеОперацииСлужебный)
		.Когда("ОграничениеУказательПередВыгрузкойЛогов")
			.Вернуть(ВерхняяГраница);
	Мокито.Прогон();

КонецПроцедуры

// Получает исходную выборку логов нужного направления.
// Параметры:
//  Входящие - Булево - направление.
//  Количество - Число - лимит.
//  Позиция - Число - нижняя граница.
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - исходный результат запроса продукта.
Функция ВыборкаЛогаТеста(Входящие, Количество, Позиция)

	Если Входящие Тогда
		Возврат кфкФоновыеОперацииСлужебный.ют_ВыборкаЛоговВходящих(Количество, Позиция);
	Иначе
		Возврат кфкФоновыеОперацииСлужебный.ют_ВыборкаЛоговИсходящих(Количество, Позиция);
	КонецЕсли;

КонецФункции

// Вызывает исходный обработчик с подставленной HTTP-сессией.
// Параметры:
//  Входящие - Булево - направление.
//  Выборка - ВыборкаИзРезультатаЗапроса - события.
//  Представления - Соответствие Из Строка - имена настроек.
//  Позиция - Число - изменяемый указатель.
Процедура ОбработатьЛогиТеста(Входящие, Выборка, Представления, Позиция)

	Параметры = ПараметрыЛогаТеста();
	Если Входящие Тогда
		кфкФоновыеОперацииСлужебный.ют_ОбработатьЛогиВходящих(
			Выборка, Представления, Параметры, ОМ_кфкФоновыеОперацииСлужебный, Позиция);
	Иначе
		кфкФоновыеОперацииСлужебный.ют_ОбработатьЛогиИсходящих(
			Выборка, Представления, Параметры, ОМ_кфкФоновыеОперацииСлужебный, Позиция);
	КонецЕсли;

КонецПроцедуры

// Читает массив событий из gzip-тела перехваченного HTTP-запроса.
// Возвращаемое значение:
//  Массив Из Соответствие Из Произвольный - десериализованные события.
Функция СобытияПерехваченногоЛога()

	Запрос = ЮТест.КонтекстТеста().ют_HTTPЗапрос; // HTTPЗапрос
	Данные = кфкОбщегоНазначенияСлужебный.ПрочитатьGZip(Запрос.ПолучитьТелоКакДвоичныеДанные());
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(Данные, КодировкаТекста.UTF8));
	Результат = ПрочитатьJSON(Чтение, Истина); // Массив Из Соответствие Из Произвольный
	Чтение.Закрыть();

	Возврат Результат;

КонецФункции

// Формирует независимый эталон внешнего события из данных фикстуры.
// Параметры:
//  Входящие - Булево - направление события.
//  Данные - см. НовоеСообщениеЛога
// Возвращаемое значение:
//  Соответствие Из Произвольный - ожидаемые поля события.
Функция ЭталонСобытияЛога(Входящие, Данные)

	Результат = Новый Соответствие; // Соответствие Из Произвольный
	Результат.Вставить("logger", ?(Входящие, "unit-kfk-consumer", "unit-kfk-producer"));
	Результат.Вставить("id", Данные.Ключ + "_" + XMLСтрока(Данные.Начало));
	Результат.Вставить("@timestamp", "2100-01-01T00:00:00.0Z");
	Результат.Вставить("record_key", Данные.Ключ);
	Результат.Вставить("message_key", "message-17");
	Результат.Вставить("msg_headers", "trace=unit-log");
	Результат.Вставить("msg_body", "тело сообщения");
	Результат.Вставить("log_text", "исходный журнал");
	Результат.Вставить("change_mark_ms", "2100-01-01T00:00:00.100Z");
	Результат.Вставить("processing_duration_ms", 123);
	Результат.Вставить("processing_count", 2);
	ДатаСобытия = ЗаписатьДатуJSON(
		Дата(2100, 1, 1), ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
	Если Входящие Тогда
		Результат.Вставить("consumer_id", XMLСтрока(Данные.Настройка));
		Результат.Вставить("consumer_name", "Имя настройки");
		Результат.Вставить("topic", "unit-log-topic");
		Результат.Вставить("load_date_ms", Данные.Начало);
		Результат.Вставить("partition", 2);
		Результат.Вставить("offset", 17);
		Результат.Вставить("status", "Обработано");
		Результат.Вставить("write_date", ДатаСобытия);
		Результат.Вставить("load_date", ДатаСобытия);
	Иначе
		Результат.Вставить("producer_id", XMLСтрока(Данные.Настройка));
		Результат.Вставить("producer_name", "Имя настройки");
		Результат.Вставить("object_type", "Документ.Заказ");
		Результат.Вставить("source_type", "Строка");
		Результат.Вставить("object_key", "object-17");
		Результат.Вставить("trigger", "");
		Результат.Вставить("status", "Выгружено");
		Результат.Вставить("registration_date", ДатаСобытия);
		Результат.Вставить("export_count", 3);
		Результат.Вставить("source", "<x>данные</x>");
		Результат.Вставить("is_delete", Истина);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Создает принадлежащую тесту исходную очередь.
// Параметры:
//  Источник - УникальныйИдентификатор - изолированный владелец исходных строк.
//  Количество - Число - число строк.
// Возвращаемое значение:
//  РегистрСведенийНаборЗаписей.кфкОчередьПотоков - исходные ключи и метки.
Функция НоваяОчередьПакетов(Источник, Количество)

	Результат = РегистрыСведений.кфкОчередьПотоков.СоздатьНаборЗаписей();
	Для Номер = 1 По Количество Цикл
		СтрокаОчереди = Результат.Добавить();
		СтрокаОчереди.Ключ = Строка(Источник) + ":" + Формат(Номер, "ЧГ=0");
		СтрокаОчереди.ВременнаяМетка = 1000000 + Номер;
		СтрокаОчереди.ИдентификаторПотока = Источник;
	КонецЦикла;
	Результат.Записать(РежимЗамещения.Добавление);

	Возврат Результат;

КонецФункции

// Возвращает настоящую выборку строк изолированного источника.
// Параметры:
//  Источник - УникальныйИдентификатор - владелец исходных строк.
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - ключи и метки в порядке возрастания времени.
Функция ВыборкаОчередиПакетов(Источник)

	// Читаем только исходные строки текущего теста в порядке меток.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.Текст = "ВЫБРАТЬ
	|	Очередь.Ключ КАК КлючЗаписи,
	|	Очередь.ВременнаяМетка КАК ВременнаяМетка,
	|	Очередь.ВременнаяМетка КАК МеткаИзмененияМС
	|ИЗ
	|	РегистрСведений.кфкОчередьПотоков КАК Очередь
	|ГДЕ
	|	Очередь.ИдентификаторПотока = &Источник
	|УПОРЯДОЧИТЬ ПО
	|	ВременнаяМетка";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

// Сопоставляет сохраненные назначения с независимым эталоном пакетов.
// Параметры:
//  Исходные - РегистрСведенийНаборЗаписей.кфкОчередьПотоков - исходные строки.
//  Потоки - Массив Из УникальныйИдентификатор - назначенные исполнители.
//  Размеры - Строка - размеры пакетов через запятую.
//  Указатели - см. кфкФоновыеОперацииСлужебный.ют_НовыеУказателиПотоков
Процедура ПроверитьНазначенияПакетов(Исходные, Потоки, Размеры, Указатели)

	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкОчередьПотоков")
		.СодержитНесколькоЗаписей(Исходные.Количество(),
			ЮТест.Предикат().Реквизит("ИдентификаторПотока").ВСписке(Потоки));
	Для Каждого СтрокаИсточника Из Исходные Цикл
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкОчередьПотоков")
			.СодержитТолькоОднуЗапись(
				ЮТест.Предикат().Реквизит("Ключ").Равно(СтрокаИсточника.Ключ)
					.Реквизит("ВременнаяМетка").Равно(СтрокаИсточника.ВременнаяМетка)
					.Реквизит("ИдентификаторПотока").ВСписке(Потоки));
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкОчередьПотоков")
			.СодержитТолькоОднуЗапись(
				ЮТест.Предикат().Реквизит("Ключ").Равно(СтрокаИсточника.Ключ)
					.Реквизит("ВременнаяМетка").Равно(СтрокаИсточника.ВременнаяМетка)
					.Реквизит("ИдентификаторПотока").Равно(СтрокаИсточника.ИдентификаторПотока));
	КонецЦикла;

	ОжидаемыеРазмеры = Новый Массив; // Массив Из Строка
	Если Размеры <> "" Тогда
		ОжидаемыеРазмеры = СтрРазделить(Размеры, ",");
	КонецЕсли;
	ЮТест.ОжидаетЧто(Указатели.Количество(), "число полных пакетов и хвостов")
		.Равно(ОжидаемыеРазмеры.Количество());
	КонецПакета = 0;
	Для Индекс = 0 По ОжидаемыеРазмеры.Количество() - 1 Цикл
		КонецПакета = КонецПакета + Число(ОжидаемыеРазмеры[Индекс]);
		ЮТест.ОжидаетЧто(Указатели[Индекс].ВременнаяМетка, "граница каждого пакета")
			.Равно(Исходные[КонецПакета - 1].ВременнаяМетка);
	КонецЦикла;

КонецПроцедуры

// Создает принадлежащую тесту настройку; запись откатывается транзакцией YAxUnit.
//
// Параметры:
//  Наименование - Строка - роль настройки в проверяемом составе.
//
// Возвращаемое значение:
//  СправочникСсылка.кфкПродюсеры - новая настройка.
Функция НовыйПродюсер(Знач Наименование)

	Возврат ЮТест.Данные().КонструкторОбъекта(Справочники.кфкПродюсеры)
		.Установить("Наименование", Наименование)
		.Установить("Брокер", кфк_т_ТестовыеДанные.СсылкаБрокераПоУмолчанию())
		.Записать(Ложь, Истина);

КонецФункции

// Возвращает упорядоченные входные настройки операции.
//
// Параметры:
//  Первая - СправочникСсылка.кфкПродюсеры - первая настройка.
//  Вторая - СправочникСсылка.кфкПродюсеры - вторая настройка.
//
// Возвращаемое значение:
//  Массив Из СправочникСсылка.кфкПродюсеры - настройки в заданном порядке.
Функция НастройкиОперации(Первая, Вторая)

	Настройки = Новый Массив; // Массив Из СправочникСсылка.кфкПродюсеры
	Настройки.Добавить(Первая);
	Настройки.Добавить(Вторая);

	Возврат Настройки;

КонецФункции
// Создает два пакета и собственные позиции; данные откатываются транзакцией теста.
//
// Параметры:
//  ПервыйЗавершен - Число - статус первого пакета.
//  ВторойЗавершен - Число - статус второго пакета.
//
// Возвращаемое значение:
//  Структура - состояние проверки:
//   * Операция - УникальныйИдентификатор - проверяемая операция.
//   * ЧужаяОперация - УникальныйИдентификатор - контрольная операция.
//   * Раздел - см. кфкФоновыеОперацииСлужебный.ют_РазделОперации
//   * Позиция - Число - текущая граница.
//   * Указатели - см. кфкФоновыеОперацииСлужебный.ют_НовыеУказателиПотоков
//   * Потоки - Массив Из УникальныйИдентификатор - действующие потоки.
Функция НовыйСценарийПозиции(ПервыйЗавершен, ВторойЗавершен)

	Операция = Новый УникальныйИдентификатор;
	ЧужаяОперация = Новый УникальныйИдентификатор;
	ПервыйПоток = Новый УникальныйИдентификатор;
	ВторойПоток = Новый УникальныйИдентификатор;
	Раздел = Новый Структура("Значение,Представление", "ПроверкаПрефикса", "Проверка префикса");
	Позиция = 1000000;

	Запись = РегистрыСведений.кфкПозицииОпераций.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Операция;
	Запись.Раздел = Раздел.Значение;
	Запись.ВременнаяМетка = Позиция;
	Запись.Записать();

	ЧужаяЗапись = РегистрыСведений.кфкПозицииОпераций.СоздатьМенеджерЗаписи();
	ЧужаяЗапись.Идентификатор = ЧужаяОперация;
	ЧужаяЗапись.Раздел = Раздел.Значение;
	ЧужаяЗапись.ВременнаяМетка = 777000;
	ЧужаяЗапись.Записать();

	Указатели = кфкФоновыеОперацииСлужебный.ют_НовыеУказателиПотоков();
	Первый = Указатели.Добавить();
	Первый.ИдентификаторПотока = ПервыйПоток;
	Первый.ВременнаяМетка = 2000000;
	Первый.СтатусПотока = ПервыйЗавершен;
	Второй = Указатели.Добавить();
	Второй.ИдентификаторПотока = ВторойПоток;
	Второй.ВременнаяМетка = 3000000;
	Второй.СтатусПотока = ВторойЗавершен;

	Потоки = Новый Массив; // Массив Из УникальныйИдентификатор
	Потоки.Добавить(ПервыйПоток);
	Потоки.Добавить(ВторойПоток);

	Сценарий = Новый Структура;
	Сценарий.Вставить("Операция", Операция);
	Сценарий.Вставить("ЧужаяОперация", ЧужаяОперация);
	Сценарий.Вставить("Раздел", Раздел);
	Сценарий.Вставить("Позиция", Позиция);
	Сценарий.Вставить("Указатели", Указатели);
	Сценарий.Вставить("Потоки", Потоки);

	Возврат Сценарий;

КонецФункции
// Проверяет позицию операции, остаток пакетов и неизменность чужой записи.
//
// Параметры:
//  Сценарий - см. НовыйСценарийПозиции
//  ОжидаемаяПозиция - Число - независимый эталон позиции.
//  ОсталосьПакетов - Число - ожидаемый остаток.
Процедура ПроверитьСценарийПозиции(Сценарий, ОжидаемаяПозиция, ОсталосьПакетов)

	ЮТест.ОжидаетЧто(Сценарий.Позиция, "граница непрерывного префикса").Равно(ОжидаемаяПозиция);
	ЮТест.ОжидаетЧто(Сценарий.Указатели.Количество(), "неучтенные пакеты сохранены").Равно(ОсталосьПакетов);

	Условие = ЮТест.Предикат()
		.Реквизит("Идентификатор").Равно(Сценарий.Операция)
		.Реквизит("Раздел").Равно(Сценарий.Раздел.Значение)
		.Реквизит("ВременнаяМетка").Равно(ОжидаемаяПозиция);
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкПозицииОпераций")
		.СодержитЗаписи(Условие, "сохраненная позиция совпадает с результатом");

	УсловиеЧужой = ЮТест.Предикат()
		.Реквизит("Идентификатор").Равно(Сценарий.ЧужаяОперация)
		.Реквизит("Раздел").Равно(Сценарий.Раздел.Значение)
		.Реквизит("ВременнаяМетка").Равно(777000);
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкПозицииОпераций")
		.СодержитЗаписи(УсловиеЧужой, "позиция чужой операции не изменена");

КонецПроцедуры

#КонецОбласти
